kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>IFS1</name>
          <description>IFS1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1CLR</name>
          <description>IFS1CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1SET</name>
          <description>IFS1SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1INV</name>
          <description>IFS1INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2</name>
          <description>IFS2 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3TXIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTMUIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2CLR</name>
          <description>IFS2CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3TXIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTMUIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2SET</name>
          <description>IFS2SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3TXIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTMUIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2INV</name>
          <description>IFS2INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3TXIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTMUIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
