kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>U1EP12CLR</name>
          <description>U1EP12CLR register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP12SET</name>
          <description>U1EP12SET register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP12INV</name>
          <description>U1EP12INV register</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP13</name>
          <description>U1EP13 register</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP13CLR</name>
          <description>U1EP13CLR register</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP13SET</name>
          <description>U1EP13SET register</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP13INV</name>
          <description>U1EP13INV register</description>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP14</name>
          <description>U1EP14 register</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP14CLR</name>
          <description>U1EP14CLR register</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP14SET</name>
          <description>U1EP14SET register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP14INV</name>
          <description>U1EP14INV register</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP15</name>
          <description>U1EP15 register</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP15CLR</name>
          <description>U1EP15CLR register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP15SET</name>
          <description>U1EP15SET register</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP15INV</name>
          <description>U1EP15INV register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
