kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTC</name>
      <description>PORTC peripheral</description>
      <baseAddress>0xbf886200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELC</name>
          <description>ANSELC register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>61440</resetValue>
          <fields>
            <field>
              <name>ANSC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ANSC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCCLR</name>
          <description>ANSELCCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ANSC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCSET</name>
          <description>ANSELCSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ANSC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCINV</name>
          <description>ANSELCINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ANSC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISC</name>
          <description>TRISC register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>61440</resetValue>
          <fields>
            <field>
              <name>TRISC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCCLR</name>
          <description>TRISCCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCSET</name>
          <description>TRISCSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCINV</name>
          <description>TRISCINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <description>PORTC register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCCLR</name>
          <description>PORTCCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCSET</name>
          <description>PORTCSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCINV</name>
          <description>PORTCINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATC</name>
          <description>LATC register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCCLR</name>
          <description>LATCCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCSET</name>
          <description>LATCSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCINV</name>
          <description>LATCINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCC</name>
          <description>ODCC register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCCCLR</name>
          <description>ODCCCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCCSET</name>
          <description>ODCCSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCCINV</name>
          <description>ODCCINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUC</name>
          <description>CNPUC register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCCLR</name>
          <description>CNPUCCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCSET</name>
          <description>CNPUCSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCINV</name>
          <description>CNPUCINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDC</name>
          <description>CNPDC register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCCLR</name>
          <description>CNPDCCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCSET</name>
          <description>CNPDCSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCINV</name>
          <description>CNPDCINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONC</name>
          <description>CNCONC register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCCLR</name>
          <description>CNCONCCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCSET</name>
          <description>CNCONCSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCINV</name>
          <description>CNCONCINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
