kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>CNENC</name>
          <description>CNENC register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCCLR</name>
          <description>CNENCCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCSET</name>
          <description>CNENCSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCINV</name>
          <description>CNENCINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATC</name>
          <description>CNSTATC register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCCLR</name>
          <description>CNSTATCCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCSET</name>
          <description>CNSTATCSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCINV</name>
          <description>CNSTATCINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
