kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>ODCD</name>
          <description>ODCD register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDCLR</name>
          <description>ODCDCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDSET</name>
          <description>ODCDSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDINV</name>
          <description>ODCDINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUD</name>
          <description>CNPUD register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDCLR</name>
          <description>CNPUDCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDSET</name>
          <description>CNPUDSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDINV</name>
          <description>CNPUDINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDD</name>
          <description>CNPDD register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDDCLR</name>
          <description>CNPDDCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDDSET</name>
          <description>CNPDDSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDDINV</name>
          <description>CNPDDINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCOND</name>
          <description>CNCOND register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDCLR</name>
          <description>CNCONDCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDSET</name>
          <description>CNCONDSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDINV</name>
          <description>CNCONDINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
