kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>CNEND</name>
          <description>CNEND register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDCLR</name>
          <description>CNENDCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDSET</name>
          <description>CNENDSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDINV</name>
          <description>CNENDINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATD</name>
          <description>CNSTATD register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDCLR</name>
          <description>CNSTATDCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDSET</name>
          <description>CNSTATDSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDINV</name>
          <description>CNSTATDINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
