kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>CNPUECLR</name>
          <description>CNPUECLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUESET</name>
          <description>CNPUESET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUEINV</name>
          <description>CNPUEINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDE</name>
          <description>CNPDE register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDECLR</name>
          <description>CNPDECLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDESET</name>
          <description>CNPDESET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDEINV</name>
          <description>CNPDEINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONE</name>
          <description>CNCONE register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONECLR</name>
          <description>CNCONECLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONESET</name>
          <description>CNCONESET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONEINV</name>
          <description>CNCONEINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENE</name>
          <description>CNENE register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENECLR</name>
          <description>CNENECLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENESET</name>
          <description>CNENESET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENEINV</name>
          <description>CNENEINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATE</name>
          <description>CNSTATE register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATECLR</name>
          <description>CNSTATECLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATESET</name>
          <description>CNSTATESET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATEINV</name>
          <description>CNSTATEINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
