kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTF</name>
      <description>PORTF peripheral</description>
      <baseAddress>0xbf886500</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELF</name>
          <description>ANSELF register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFCLR</name>
          <description>ANSELFCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFSET</name>
          <description>ANSELFSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFINV</name>
          <description>ANSELFINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>TRISF</name>
          <description>TRISF register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>59</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFCLR</name>
          <description>TRISFCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFSET</name>
          <description>TRISFSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFINV</name>
          <description>TRISFINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTF</name>
          <description>PORTF register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFCLR</name>
          <description>PORTFCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFSET</name>
          <description>PORTFSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFINV</name>
          <description>PORTFINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATF</name>
          <description>LATF register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFCLR</name>
          <description>LATFCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFSET</name>
          <description>LATFSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFINV</name>
          <description>LATFINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCF</name>
          <description>ODCF register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCFCLR</name>
          <description>ODCFCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCFSET</name>
          <description>ODCFSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCFINV</name>
          <description>ODCFINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUF</name>
          <description>CNPUF register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFCLR</name>
          <description>CNPUFCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFSET</name>
          <description>CNPUFSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFINV</name>
          <description>CNPUFINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDF</name>
          <description>CNPDF register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFCLR</name>
          <description>CNPDFCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFSET</name>
          <description>CNPDFSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFINV</name>
          <description>CNPDFINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONF</name>
          <description>CNCONF register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFCLR</name>
          <description>CNCONFCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFSET</name>
          <description>CNCONFSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
