kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
        <register>
          <name>CNCONFINV</name>
          <description>CNCONFINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENF</name>
          <description>CNENF register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFCLR</name>
          <description>CNENFCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFSET</name>
          <description>CNENFSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFINV</name>
          <description>CNENFINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATF</name>
          <description>CNSTATF register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFCLR</name>
          <description>CNSTATFCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFSET</name>
          <description>CNSTATFSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFINV</name>
          <description>CNSTATFINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
