kiffie/edc2svd/ci/regtest/PIC32MX470F512H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTG</name>
      <description>PORTG peripheral</description>
      <baseAddress>0xbf886600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELG</name>
          <description>ANSELG register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>960</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGCLR</name>
          <description>ANSELGCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGSET</name>
          <description>ANSELGSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGINV</name>
          <description>ANSELGINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISG</name>
          <description>TRISG register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>960</resetValue>
          <fields>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGCLR</name>
          <description>TRISGCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGSET</name>
          <description>TRISGSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGINV</name>
          <description>TRISGINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTG</name>
          <description>PORTG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGCLR</name>
          <description>PORTGCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGSET</name>
          <description>PORTGSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGINV</name>
          <description>PORTGINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATG</name>
          <description>LATG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGCLR</name>
          <description>LATGCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGSET</name>
          <description>LATGSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGINV</name>
          <description>LATGINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCG</name>
          <description>ODCG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGCLR</name>
          <description>ODCGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGSET</name>
          <description>ODCGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGINV</name>
          <description>ODCGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUG</name>
          <description>CNPUG register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGCLR</name>
          <description>CNPUGCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGSET</name>
          <description>CNPUGSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGINV</name>
          <description>CNPUGINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDG</name>
          <description>CNPDG register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGCLR</name>
          <description>CNPDGCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGSET</name>
          <description>CNPDGSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGINV</name>
          <description>CNPDGINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONG</name>
          <description>CNCONG register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGCLR</name>
          <description>CNCONGCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGSET</name>
          <description>CNCONGSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGINV</name>
          <description>CNCONGINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
